src/Enums/РольПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РольПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйВрач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистратура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СестраХозяйка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистраторБазыДанных</Name>
					<Comment>Администратор базы данных</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/СтоматологияСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ЭкспортныеПроцедурыИФункции

// Выводит сообщение об ошибке заполнения поля.
//
Процедура СообщитьОбОшибке(ОбъектСОшибкой, ТекстСообщения, ИмяТабличнойЧасти = Неопределено, НомерСтроки = Неопределено, Поле = Неопределено, Отказ = Ложь, МассивСообщений = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	
	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		// Платформа 8.2.15
		
	Иначе
		
		Если ИмяТабличнойЧасти <> Неопределено Тогда
			Сообщение.Поле = ИмяТабличнойЧасти + "[" + (НомерСтроки - 1) + "]." + Поле;
		ИначеЕсли ЗначениеЗаполнено(Поле) Тогда
			Сообщение.Поле = Поле;
		КонецЕсли;
		
		Сообщение.УстановитьДанные(ОбъектСОшибкой);
		
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
	// Розница.ОтрицательныеОстатки
	Если МассивСообщений <> Неопределено Тогда
		МассивСообщений.Добавить(Новый Структура("Текст, Поле", Сообщение.Текст, Сообщение.Поле));
	КонецЕсли;
	
КонецПроцедуры

// Процедура удаляет проверяемый реквизит из массива проверяемых реквизитов.
Процедура УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, ПроверяемыйРеквизит) Экспорт
	
	НайденныйРеквизит = ПроверяемыеРеквизиты.Найти(ПроверяемыйРеквизит);
	Если ЗначениеЗаполнено(НайденныйРеквизит) Тогда
		ПроверяемыеРеквизиты.Удалить(НайденныйРеквизит);
	КонецЕсли;
	
КонецПроцедуры // УдалитьПроверяемыйРеквизит()

// Функция - Получить структуру стека оповещения пользователя
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруСтекаОповещенияПользователя() Экспорт
	
	Возврат РегистрыСведений.СтекОповещенийПоВзаимодействиям.ПолучитьСтруктуруСтекаОповещенияПользователя();
	
КонецФункции

#КонецОбласти

#Область ПроцедурыФункцииУправленияРабочимСтолом

// Определяет состав форм рабочего стола в зависимости от прав доступа пользователя.
//
Процедура УстановитьРабочийСтолПользователя(СоставФормИзменен = Ложь) Экспорт
	
	РежимРаботы = ОбщегоНазначенияПовтИсп.РежимРаботыПрограммы();
	Если РежимРаботы.МодельСервиса
		И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиНачальнойСтраницы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить("Общее/НастройкиНачальнойСтраницы", "");

	Если НастройкиНачальнойСтраницы = Неопределено 
		 ИЛИ ПодключаемоеОборудованиеКассовыйСервер.ЭтоПользовательКассовогоСервера(ПараметрыСеанса.ТекущийПользователь) = Истина Тогда
		
		УстановитьСоставФорм(СоставФормИзменен);
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет состав форм рабочего стола в зависимости от прав доступа пользователя.
//
Процедура УстановитьСоставФорм(СоставФормИзменен = Ложь, ИмяПользователя = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	СоставФорм.ЛеваяКолонка.Очистить();
	
	НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения;
	НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Авто;
	НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НастройкиКлиентскогоПриложения);
		
	// В зависимости от роли изменяем начальную страницу
	Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.ГлавныйВрач 
		Или ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач
		Или ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Регистратура Тогда
		// Или ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Руководитель
		// ИЛИ ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Управляющий Тогда
		
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.РабочийКалендарь.Форма.ФормаЗаписи");
		
	КонецЕсли;
	
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Общее/НастройкиНачальнойСтраницы", "", НастройкиНачальнойСтраницы,, ИмяПользователя);
	Иначе
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Общее/НастройкиНачальнойСтраницы", "", НастройкиНачальнойСтраницы);
	КонецЕсли;
	
	НастройкиКомандногоИнтерфейса = Новый НастройкиКомандногоИнтерфейса;
	НастройкиКомандногоИнтерфейса.ОтображениеПанелиРазделов = ОтображениеПанелиРазделов.Картинка;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/ПанельРазделов/НастройкиКомандногоИнтерфейса", "",НастройкиНачальнойСтраницы, , ИмяПользователя);
	
	НастройкиИнтерфейсаКлиентскогоПриложения = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = НастройкиИнтерфейсаКлиентскогоПриложения.ПолучитьСостав();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Право.Очистить();
	НастройкиСостава.Верх.Добавить( Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	НастройкиСостава.Лево.Добавить( Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	
	НастройкиИнтерфейсаКлиентскогоПриложения.УстановитьСостав(НастройкиСостава);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "",НастройкиИнтерфейсаКлиентскогоПриложения, , ИмяПользователя);
	
	СоставФормИзменен = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
